docs/developing.md
```mermaid
erDiagram
    album {
        int album_id
        int ripper_id
        text gid
        text url
        text uploader
        text title
        text description
        int created_ts
        int modified_ts
        int fetch_count
        bool hidden
        bool removed
        int local_rating
        int last_fetch_ts
        int inserted_ts
    }
    map_album_remote_file {
        int remote_file_id
        int album_id
    }
    remote_file {
        int remote_file_id
        int ripper_id
        text urlid
        text url_base
        text url_path
        text filename
        int mime_type_id
        int bytes
        int width_px
        int height_px
        int duration_ms
        text title
        text description
        int uploaded_ts
        text uploader
        text aux
        bool hidden
        bool removed
        bool fetched
        bool ignored
        int local_rating
        int inserted_ts
    }
    map_album_tag {
        int album_id
        int tag_id
    }
    map_remote_file_tag {
        int remote_file_id
        int tag_id
    }
    mime_type {
        int mime_type_id
        text name
    }
    ripper {
        int ripper_id
        text name
        text host
    }
    tag {
        int tag_id
        text name
    }

    album                 }o--|| ripper                : ""
    ripper                ||--o{ remote_file           : ""
    album                 ||--o{ map_album_remote_file : ""
    map_album_remote_file }o--|| remote_file           : ""
    mime_type             |o..|| remote_file           : ""
    album                 ||--o{ map_album_tag         : ""
    map_album_tag         }|--|| tag                   : ""
    remote_file           ||--o{ map_remote_file_tag   : ""
    tag                   ||--|{ map_remote_file_tag   : ""
```
